Revit 2024 API
View.Print Method (Boolean)
Print this view with the default view template, and either the view's document's print setting or the print setting of the current active document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void Print(
	bool useCurrentPrintSettings
)
Visual Basic
Public Sub Print ( _
	useCurrentPrintSettings As Boolean _
)
Visual C++
public:
void Print(
	bool useCurrentPrintSettings
)
Parameters
useCurrentPrintSettings
Type: System.Boolean
If true, print the view with the print setting of the current active document; otherwise with the view's document's print setting.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException | Thrown when the view cannot be printed.
See Also
View Class
Print Overload
Autodesk.Revit.DB Namespace